### Pandas
- Intro
    - One of the datascience package
    - Used for data manupilation,data analysis and data cleaning
    - developed by WesMcKinney
   
- Installtion
    - For windows
        - pip install pandas
   - For linux
       - sudo apt-get install python3 pandas
- Key Structures in Pandas
    - Series
        - Sequence of data
        - syntax
            - Series(var,index)
        - How to create Series
        - Retrieve Series
    - DataFrames

In [1]:
import pandas as pd
pd.__version__

'0.23.4'

In [2]:
st = 'Hello'
pd.Series(st)

0    Hello
dtype: object

In [3]:
st1 = input().split()
pd.Series(st1)

Hello Hii

0    Hello
1      Hii
dtype: object

In [9]:
li = [123,'abc','def',23.5]
pd.Series(li,index=['A','B','C','D'])

A     123
B     abc
C     def
D    23.5
dtype: object

In [6]:
t = (1,2,3,'a','b','c')
pd.Series(t)

0    1
1    2
2    3
3    a
4    b
5    c
dtype: object

In [10]:
d = {'Course':'Python','Org':'APSSDC'}
pd.Series(d)

Course    Python
Org       APSSDC
dtype: object

In [12]:
pd.Series(d,index=['A','Org'])

A         NaN
Org    APSSDC
dtype: object

 0      0
 1      1
 2      4
 3      9

In [13]:
num = int(input("Enter number: "))
l = {i:i**2 for i in range(1,num)}
o = pd.Series(l)
o

Enter number: 8

1     1
2     4
3     9
4    16
5    25
6    36
7    49
dtype: int64

In [14]:
import numpy as np
ar = np.arange(4,10)
pd.Series(ar)

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int32

In [15]:
r = np.random.randint(2,20,8)
pd.Series(r)

0    11
1    19
2     2
3     8
4    17
5     3
6    10
7     2
dtype: int32

In [16]:
q = pd.Series(np.array(range(0,10))**2,index=range(0,10))
q

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

In [17]:
q[0:4]

0    0
1    1
2    4
3    9
dtype: int32

In [18]:
q[0:]

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

In [19]:
q[:4]

0    0
1    1
2    4
3    9
dtype: int32

In [20]:
q[0:9:2]

0     0
2     4
4    16
6    36
8    64
dtype: int32

- contains data with rows and columns
- creation
- retrieve

In [21]:
name = input().split()
pd.DataFrame(name)

python program

         0
0   python
1  program

In [23]:
data = [['Ambika','Python'],['Pavani','Gaming'],['Poojitha','MSTP']]
pd.DataFrame(data)

          0       1
0    Ambika  Python
1    Pavani  Gaming
2  Poojitha    MSTP

In [24]:
pd.DataFrame(data,index=['One','Two','Three'])

              0       1
One      Ambika  Python
Two      Pavani  Gaming
Three  Poojitha    MSTP

In [25]:
pd.DataFrame(data,index=['One','Two','Three'],columns=['Name','Desig'])

           Name   Desig
One      Ambika  Python
Two      Pavani  Gaming
Three  Poojitha    MSTP

In [27]:
dic1 = {'Name':'Ambika','Org':'APSSDC','Team':'Python'}
pd.DataFrame(dic1,index=['One'])

       Name     Org    Team
One  Ambika  APSSDC  Python

In [29]:
dic2 = {'Clg':'SVECW','Branch':'ECE'}
pd.DataFrame([dic1,dic2])

  Branch    Clg    Name     Org    Team
0    NaN    NaN  Ambika  APSSDC  Python
1    ECE  SVECW     NaN     NaN     NaN

In [33]:
t1 = {'Name':'Ambika','Org':'APSSDC','Team':'Python'}
t2 = {'Name':'Pavani','Org':'APSSDC','Team':'Gaming','Desig':'Trainer'}
t3 = {'Name':'Poojitha','Org':'APSSDC','Team':'MSTP'}
t4 = {'Name':'Archana','Org':'APSSDC','Team':'Cyber Security'}
s = pd.DataFrame([t1,t2,t3,t4],index=['One','Two','Three','Four'],columns=['Name','Org','Team','Desig'])
s

           Name     Org            Team    Desig
One      Ambika  APSSDC          Python      NaN
Two      Pavani  APSSDC          Gaming  Trainer
Three  Poojitha  APSSDC            MSTP      NaN
Four    Archana  APSSDC  Cyber Security      NaN

- Retieving DataFrames
    - loc --- index data
    - iloc --- index position

In [34]:
s

           Name     Org            Team    Desig
One      Ambika  APSSDC          Python      NaN
Two      Pavani  APSSDC          Gaming  Trainer
Three  Poojitha  APSSDC            MSTP      NaN
Four    Archana  APSSDC  Cyber Security      NaN

In [35]:
s.loc['Two']

Name      Pavani
Org       APSSDC
Team      Gaming
Desig    Trainer
Name: Two, dtype: object

In [36]:
s.iloc[1]

Name      Pavani
Org       APSSDC
Team      Gaming
Desig    Trainer
Name: Two, dtype: object

In [37]:
s

           Name     Org            Team    Desig
One      Ambika  APSSDC          Python      NaN
Two      Pavani  APSSDC          Gaming  Trainer
Three  Poojitha  APSSDC            MSTP      NaN
Four    Archana  APSSDC  Cyber Security      NaN

In [38]:
s['Platform'] = 'Online'
s

           Name     Org            Team    Desig Platform
One      Ambika  APSSDC          Python      NaN   Online
Two      Pavani  APSSDC          Gaming  Trainer   Online
Three  Poojitha  APSSDC            MSTP      NaN   Online
Four    Archana  APSSDC  Cyber Security      NaN   Online

In [39]:
a = s.T
a

             One      Two     Three            Four
Name      Ambika   Pavani  Poojitha         Archana
Org       APSSDC   APSSDC    APSSDC          APSSDC
Team      Python   Gaming      MSTP  Cyber Security
Desig        NaN  Trainer       NaN             NaN
Platform  Online   Online    Online          Online

In [40]:
a.loc['Org']

One      APSSDC
Two      APSSDC
Three    APSSDC
Four     APSSDC
Name: Org, dtype: object

In [41]:
a.iloc[1]

One      APSSDC
Two      APSSDC
Three    APSSDC
Four     APSSDC
Name: Org, dtype: object

In [42]:
s

           Name     Org            Team    Desig Platform
One      Ambika  APSSDC          Python      NaN   Online
Two      Pavani  APSSDC          Gaming  Trainer   Online
Three  Poojitha  APSSDC            MSTP      NaN   Online
Four    Archana  APSSDC  Cyber Security      NaN   Online

In [43]:
s.drop('One')

           Name     Org            Team    Desig Platform
Two      Pavani  APSSDC          Gaming  Trainer   Online
Three  Poojitha  APSSDC            MSTP      NaN   Online
Four    Archana  APSSDC  Cyber Security      NaN   Online

In [46]:
df1 = pd.DataFrame({"num":[1,2,3,4],
                   "age":[20,30,40,50]},
                  index=[2000,2001,2002,2003])
df1

      num  age
2000    1   20
2001    2   30
2002    3   40
2003    4   50

In [51]:
df2 = pd.DataFrame({"num1":[5,6,7,8],
                   "age1":[30,40,50,70]},
                  index=[2004,2003,2006,2000])
df2

      num1  age1
2004     5    30
2003     6    40
2006     7    50
2000     8    70

In [53]:
df1

      num  age
2000    1   20
2001    2   30
2002    3   40
2003    4   50

In [52]:
df1.join(df2)

      num  age  num1  age1
2000    1   20   8.0  70.0
2001    2   30   NaN   NaN
2002    3   40   NaN   NaN
2003    4   50   6.0  40.0

In [54]:
df3 = pd.DataFrame({"weight":[80,90,60,70],
                   "num":[1,2,3,4],
                   "age":[20,30,40,50]},
                  index=[2000,2001,2002,2003])
df3

      weight  num  age
2000      80    1   20
2001      90    2   30
2002      60    3   40
2003      70    4   50

In [61]:
df4 = pd.DataFrame({"weight":[80,66,40,70],
                   "num":[1,5,3,4],
                   "age":[20,22,40,50]},
                  index=[2000,2005,2006,2004])
df4

      weight  num  age
2000      80    1   20
2005      66    5   22
2006      40    3   40
2004      70    4   50

In [65]:
df3.merge(df4)

   weight  num  age
0      80    1   20
1      70    4   50

In [66]:
df3.merge(df4,on='weight')

   weight  num_x  age_x  num_y  age_y
0      80      1     20      1     20
1      70      4     50      4     50

In [64]:
con = pd.concat([df1,df2])
con

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       age  age1  num  num1
2000  20.0   NaN  1.0   NaN
2001  30.0   NaN  2.0   NaN
2002  40.0   NaN  3.0   NaN
2003  50.0   NaN  4.0   NaN
2004   NaN  30.0  NaN   5.0
2003   NaN  40.0  NaN   6.0
2006   NaN  50.0  NaN   7.0
2000   NaN  70.0  NaN   8.0

In [67]:
dates = pd.date_range('2020-01-11','2020-01-22')
pd.Series(dates)

0    2020-01-11
1    2020-01-12
2    2020-01-13
3    2020-01-14
4    2020-01-15
5    2020-01-16
6    2020-01-17
7    2020-01-18
8    2020-01-19
9    2020-01-20
10   2020-01-21
11   2020-01-22
dtype: datetime64[ns]

In [68]:
dates1 = pd.date_range('2020-01-11',periods=7)
dates1

DatetimeIndex(['2020-01-11', '2020-01-12', '2020-01-13', '2020-01-14',
               '2020-01-15', '2020-01-16', '2020-01-17'],
              dtype='datetime64[ns]', freq='D')